---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedRowsCount
source: html/18bfd8a4-58ac-3fdf-0d6f-5a17023ef401.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedRowsCount Property

"Segments in Viewport"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSchedRowsCount { get; }
```